Repository: mr-vara/my-react-localization-plugin
Catalog: languages/*-react-localization-plugin-*.po
Languages: de_de, es_es, fr_fr

source: My React Localization Plugin
de_de: Mein React-Lokalisierungs-Plugin
es_es: Mi plugin de localización de React
fr_fr: Mon plugin de localisation React

source: A simple WordPress plugin demonstrating React frontend with PHP backend and localization.
de_de: Ein einfaches WordPress-Plugin, das das React-Frontend mit PHP-Backend und Lokalisierung demonstriert.
es_es: Un sencillo plugin de WordPress que demuestra el frontend de React con el backend y la localización de PHP.
fr_fr: Un plugin WordPress simple démontrant le frontend React avec le backend PHP et la localisation.

source: Your Name
de_de: Ihr Name
es_es: Te llamas
fr_fr: Votre nom

source: React Localization Example
de_de: Beispiel f√ºr eine React-Lokalisierung
es_es: Ejemplo de localización de React
fr_fr: Exemple de localisation React

source: This is a static message from React frontend!
de_de: Dies ist eine statische Nachricht vom React-Frontend!
es_es: ¡Este es un mensaje estático de la interfaz de React!
fr_fr: Il s’agit d’un message statique de l’interface React !

source: Hello Again and Again
de_de: Hallo immer wieder
es_es: Hola una y otra vez
fr_fr: Bonjour encore et encore

source: Hello
de_de: Hallo
es_es: Hola
fr_fr: Bonjour

# Some context about the string
source: This is a static message from PHP backend!
de_de: Dies ist eine statische Nachricht vom PHP-Backend!
es_es: ¡Este es un mensaje estático del backend de PHP!
fr_fr: Il s’agit d’un message statique du backend PHP !

# some context with x
source: Hello with x
de_de: Hallo mit x
es_es: Hola con x
fr_fr: Bonjour avec x

# some context with x1
source: Hello with x1
de_de: Hallo mit x1
es_es: Hola con x1
fr_fr: Bonjour avec x1

# some context with x2
source: Hello with x2
de_de: Hallo mit x2
es_es: Hola con x2
fr_fr: Bonjour avec x2
